app/controllers/posts_controller.rb

	def create
	  @post = Post.new
	  @post.title = params[:title]
		@post.description = params[:description]
		# @post = Post.new(post_params(:title, :description))
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]

	def update
	  @post = Post.find(params[:id])
		# @post.update(title: params[:title], description: params[:description])
		@post.update(post_params(:title, :description))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2015-12-31 21:17:16.238910"], ["id", 3]]